<?php
// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------

return [
    // 模板引擎类型使用Think
    // 模板后缀
    //替换标签
    'tpl_replace_string' => [
        '__STATIC__' => '/dev',
        '__JS__' => '/dev/js',
        '__PLUGINS__' => '/dev/plugins',
        '__CSS__' => '/dev/css',
        '__IMG__' => '/dev/image',
        '__VUE__' => '/dev/vue'
    ],
    'view_suffix' => 'html',
    'type' => 'Think',
    // 模板引擎普通标签开始标记
//    'tpl_begin'     => '{',
//    // 模板引擎普通标签结束标记
//    'tpl_end'       => '}',
//    // 标签库标签开始标记
//    'taglib_begin'  => '{',
//    // 标签库标签结束标记
//    'taglib_end'    => '}',

];
